		IDENTIFICATION DIVISION.
		PROGRAM-ID. BANK.
				
	
		DATA DIVISION.
		WORKING-STORAGE SECTION.


		01 BALANCE PIC	 9(5) VALUE 1000.
		01 BAL-DISPLAY	 PIC Z(5).

		PROCEDURE DIVISION.

			MOVE BALANCE TO BAL-DISPLAY.

			DISPLAY "INITIAL BALANCE: ".
			DISPLAY BAL-DISPLAY.

			STOP RUN.
