       IDENTIFICATION DIVISION.
       PROGRAM-ID. HELLO.

       PROCEDURE DIVISION.
           DISPLAY "HELLO BRO, COBOL IS WORKING".
           STOP RUN.
